#pragma once
#include "base_struct.h"
/*
 * @brief 左、右激光雷达的标定数据
 * x_vehicl = R*x_lidar + t
 * R为旋转矩阵，t为平移向量
 * 参考文本： https://blog.csdn.net/m0_68312479/article/details/128266483
 */
static LidarCailData lidatcalidat[2] =
{

	{
		/*.index = */LEFTLidar,
		/* .R = */{
			 {0.9107632803973996,
			  -0.4129280248403057,
			  0.000832695173289026,},
			 {0.41291721696474615,
			  0.9107205926757981,
			  -0.009347406609957832,},
			 {0.0031014535070930487,
			  0.008857108880828014,
			  0.9999559653346825,},
		 },
		 /* .t = */{ 3.7698120534649897,
			  0.601708392974325,
			  -0.0306977255118715},

	  },

	  {
		  /*.index =*/ RIGHTLidar,
		  /* .R = */{
			   {0.8816557866918299,
				0.4718634014930756,
				0.005291892307735511,},
			   {-0.4718348081047446,
				0.8813152723985406,
				0.025598915950577505,},
			   {0.007415366044279181,
				-0.02506633137239578,
				0.9996582873051963,},
		   },
		   /*.t =*/ { 3.7698120534649897,
			   -0.6296586439664944,
			   -0.022556277760540214},
	 }

};
#ifdef __cplusplus
extern "C" {
#endif
	inline const LidarCailData  GetLidarCaliDat(const LidarIndex index)
	{
		return lidatcalidat[index];
	}
#ifdef __cplusplus
}
#endif
